#include<stdio.h>
int main()
{	int n,a,b,c,d,e;									/*定义6个整型变量*/ 
	printf("请输入一个不大于4位数的正整数:");			/*提示显示信息*/ 
	scanf("%d",&n);										/*输入变量n*/ 
	a=n/1000;											
	b=n/100%10;
	c=n/10%10;
	d=n%10; 											/*变量a,b,c,d与n的函数关系*/ 
	if(n>999&&n<10000)									/*满足4位数的条件*/ 
	{e=a*b*c*d;											/*四位数是各位数之积*/ 
	printf("为4位数\n各位数之积:%d\n",e);				/*输出结果*/ 
	}
	else 												 
		if(n>99&&n<1000)								/*条件变为满足3位数*/ 
		{e=b*c*d; 
		printf("为3位数\n各位数之积:%d\n",e);			/*输出3位数结果*/ 
		}
		else
			if(n>9&&n<100)								/*条件变为满足2位数*/ 
			{e=c*d;
			printf("为2位数\n各位数之积:%d\n",e);		/*输出2位数结果*/ 
			}
			else
				if(n<10)								/*满足个位数条件*/ 
				{e=d;
				printf("为1位数\n各位数之积:%d\n",e);	/*输出个位数结果*/ 
				}			
	return 0;			
}
